[
  {
    "operation": "create",
    "document": {
      "id": "ewgd",
      "title": "Electronisch woordenboek van de Gelderse dialecten",
      "intro": "The e-WGD is an online dictionary of dialects from the Dutch province Gelderland, specifically the regions Rivierenstreek and Veluwe. It stands for Electronisch woordenboek van de Gelderse dialecten.",
      "publishedAt": "2019",
      "media": {
        "slider": [
          "https://raw.githubusercontent.com/CLARIAH/ineo-content/master/media/taalkaart-wgd.jpg",
          "https://raw.githubusercontent.com/CLARIAH/ineo-content/master/media/boeken-wgd.jpg",
          "https://raw.githubusercontent.com/CLARIAH/ineo-content/master/media/taalkaart-wgd_vindplaatsen.jpg"
        ]
      },
      "tabs": {
        "overview": {
          "body": "### Overview\n * The e-WGD contains comprises the six volumes of the *Woordenboek van de Gelderse dialecten*, that were compiled between 2001 and 2006.\n\n* The (e-)WGD contains information about the dialects of the Rivierenstreek and Veluwe, the two darker shaded areas on the map shown below. The two lighter shaded areas on the map are the regions Liemers and Achterhoek, the dialects of which are described in the [e-WALD](https://www.ineo.tools/resources/ewald). Together they cover the entire Dutch province of Gelderland.\n\n* The e-WGD contains more information than the WGB. With questionnaires extra material was collected, that was not included in the printed issues for various reasons.\n\n* Users can query the e-WGD for keywords and concepts, as well as locations (using a placename or a [Kloekecode](https://kloeke.meertens.knaw.nl/)) and dialects.\n\n* The e-WGD contains 3,544 concepts, 55,745 keywords, and 168,417 dialectal entries, collected in 107 places throughout Gelderland, with each place corresponding to its own dialect.\n\n* Together with the [e-WALD](https://www.ineo.tools/resources/ewald), [e-WBD](https://www.ineo.tools/resources/ewbd) and the [e-WLD](https://www.ineo.tools/resources/ewld), the e-WGD forms a series of electronic dictionaries.\n\n![Research area of the WGD.](https://github.com/CLARIAH/ineo-content/blob/master/media/taalkaart-wgd.jpg?raw=1)\n\n![Original in-press publication of the *Woordenboek van de Gelderse dialecten*, that the e-WGD makes available digitally.](https://github.com/CLARIAH/ineo-content/blob/master/media/boeken-wgd.jpg)\n\n### About\n\n#### Research areas\nThe map below includes the research area of the WGD. The area includes the Rivierenstreek and the Veluwe. The map shows which places participated; these are the places where volunteers were found to complete the questionnaires. Unfortunately the city of Arnhem is not among those places.\n\nSome places outside the area have also been included to see how adjacent areas connect. For the Rivierenstreek these are Rhenen, Achterberg and Leerbroek. For the Veluwe these are Bunschoten-Spakenburg and Huizen.\n\n![Research area of the WGD.](https://github.com/CLARIAH/ineo-content/blob/master/media/taalkaart-wgd_vindplaatsen.jpg)"
        },
        "learn": {
          "body": "A manual on how to query the e-WGD can be found [on the e-WGD webpage](https://e-wgd.nl/guide). (**This manual is only available in Dutch, however.**)"
        },
        "mentions": {
          "body": "Together with three other electronic dictionaries, the e-WALD forms a series:\n* The [e-WALD](https://www.ineo.tools/resources/ewald) (Electronisch woordenboek van de Achterhoekse en Liemerse dialecten);\n* The [e-WBD](https://www.ineo.tools/resources/ewbd) ((Electronisch woordenboek van de Brabantse dialecten);\n* The [e-WLD](https://www.ineo.tools/resources/ewld) (Electronisch woordenboek van de Limburgse dialecten).\n\nThe e-WGD was originally published as an in-press publication. More information on the books and volumes can be found [here](https://e-wgd.nl/delen).\n\nThe source code that facilitates the Django web applications of the electronic dialect dictionaries can be found on GitHub [here](https://github.com/ErwinKomen/RU-Wnd).\n\n### Credits and Contact Information\n\nThe e-WGD application was developed by Erwin Komen of the [Technical Support Group of the Humanities Lab of Radboud University](https://www.ru.nl/facultyofarts/research/humanities-lab/our-labs/) under the supervision of Henk van den Heuvel. Roeland van Hout was responsible for designing the content of the e-WGD. Thijs Hermsen made the maps.\n\nFor technical information or issues regarding the e-WGD, you can contact dr. Henk van den Heuvel (H.vandenHeuvel@Let.ru.nl), Director CLST & Head of the Humanities Lab.\nRegarding the contents of the e-WGD, you can contact prof. dr. Roeland van Hout (r.v.hout@let.ru.nl).\n\n#### Editing and digitization\n\nBetween 2001 and 2006, six printed issues of the *Woordenboek van de Gelderse dialecten* (WGD) were compiled: three parts for the Rivierenstreek (edited by Dr. Charlotte Giesbers) and three parts for the Veluwe (edited by Dr. Harrie Scholtmeijer, for the part about humanity together with Dr. Charlotte Giesbers). The dictionaries describe specific parts of the general vocabulary: the house, man and the world. The information in the dictionaries comes from a large number of informants who voluntarily completed the questionnaires. The project was funded by the Province of Gelderland and the Faculty of Arts of Radboud University Nijmegen. In addition, several parties were involved in the creation of the WGD: Gelders Erfgoed, the Staring Institute, the IJssel Academy and the Cross-border Regional Languages Foundation.\n\nIn 2015, the first volumes of the *Woordenboek van de Gelderse dialecten* (WGD) were digitized thanks to a subsidy awarded by CLARIN for the project 'CARE: Curation and integration of regional dictionaries' led by Nicoline van der Sijs, Henk van den Heuvel and Roeland van Hout.\n\nSubsequently, in 2021, a subsidy was awarded by the Lower Saxony Gelderland incentive fund of the Erfgoedcentrum Achterhoek Liemers (ECAL) to further develop the WGD website for the Veluwe dialects. In addition, the material from the Rivierenstreek has been made completely accessible. The new version of the WGD is available from May 2022. The e-WGD contains more material than the printed parts. The questionnaires collected additional material that, for various reasons, was not included in the printed issues of the WGD. The website contains all useful material from the questionnaires. In the printed editions, on the other hand, data from an older dialect survey and local dictionaries were used. This data is not included in the e-WGD."
        },
        "metadata": {}
      },
      "properties": {
        "programmingLanguages": [
          {
            "title": "Django with Python3",
            "link": null
          }
        ],
        "funding": [
          {
            "title": "ClariaH",
            "link": "https://www.clariah.nl/projecten/research-pilots/acad"
          }
        ],
        "problemContact": [
          {
            "title": "Issue tracker",
            "link": "https://github.com/ErwinKomen/RU-wnd/issues"
          }
        ],
        "informationTypes": [],
        "access": [
          {
            "title": "Open Access",
            "link": "https://github.com/ErwinKomen/RU-wnd"
          }
        ],
        "sourceCodeLocation": [
          {
            "title": "github.com",
            "link": "https://github.com/ErwinKomen/RU-wnd"
          }
        ],
        "researchContact": [],
        "generalContact": [
          {
            "title": "Erwin Komen",
            "link": ""
          }
        ],
        "resourceTypes": [
          "Tools"
        ],
        "status": [
          "Active"
        ],
        "versions": [
          {
            "title": "unknown",
            "url": ""
          }
        ],
        "standards": [],
        "resourceOwner": [
          {
            "title": "Technical Support Group",
            "link": "https://www.ru.nl/facultyofarts/research/humanities-lab/our-labs"
          }
        ],
        "link": "https://github.com/ErwinKomen/RU-wnd",
        "intro": "Django web application that facilities viewing and searching a dictionary of Dutch dialects from the province 'Gelderland'",
        "provenance": [],
        "community": [
          {
            "title": "Issue tracker",
            "link": "https://github.com/ErwinKomen/RU-wnd/issues"
          }
        ],
        "development": [
          {
            "title": "Erwin Komen, Humanities Lab",
            "link": ""
          }
        ]
      }
    }
  }
]